# DownloadFinished Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CreateRelatedFileProgressChangedEventArgs..::..DownloadFinished Property
CreateRelatedFileProgressChangedEventArgs Class See Also
---
Indicates if all data downloads are finished.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool DownloadFinished { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DownloadFinished As Boolean
	Get
```

Visual C++
---
```text
public:
property bool DownloadFinished {
	bool get ();
}
```

# See Also
CreateRelatedFileProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace